// 主程序

// 输出LOGO
console.log(String.raw`%c- IpacServerManager v0.0.0
 ______                                                            __
/\__  _\                                                          /\ \
\/_/\ \/    _____     ____     ____   ____    ____ ___     ____   \_\ \
   \ \ \   /\  __ \  / __ \   / ___\ / __ \  /  __  __ \  / __ \  / __ \
    \_\ \__\ \ \/\ \/\ \/\ \_/\ \__//\ \/\ \_/\ \/\ \/\ \/\ \/\ \/\ \/\ \
    /\_____\\ \  __/\ \__/ \_\ \____\ \__/ \_\ \_\ \_\ \_\ \____/\ \_____\
    \/_____/ \ \ \/  \/__/\/_/\/____/\/__/\/_/\/_/\/_/\/_/\/___/  \/____ /
              \ \_\
               \/_/
`, 'color:#008fff');


// 库
import('./plugins/lib.js');

// 事件
import('./plugins/event.js');

// 页面模块
import('./plugins/pages.js');

// 页面功能
import('./plugins/ui.js');

// 登录
import('./plugins/login.js');




// 加载基础资源 -> 登录 -> 加载应用模块
// 




// 结束
// logger.info('[MAIN] 服务器启动完成! 耗时 '+ (performance.now() - Config._c.start_time) +'ms');
// logger.info('> ----------------------------------------------------- <'); // 57
